stubs/src/main/resources/wsdl/nfce/mg/hom/authorization.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b220215.0856 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b220215.0856 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4" name="NFeAutorizacao4">
<types>
<xsd:schema>
<xsd:import namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4" schemaLocation="https://hnfce.fazenda.mg.gov.br:443/nfce/services/NFeAutorizacao4?xsd=1"/>
</xsd:schema>
</types>
<message name="nfeAutorizacaoLoteZip">
<part name="nfeDadosMsgZip" element="tns:nfeDadosMsgZip"/>
</message>
<message name="nfeAutorizacaoLoteZipResponse">
<part name="nfeAutorizacaoLoteZipResult" element="tns:nfeResultMsg"/>
</message>
<message name="nfeAutorizacaoLote">
<part name="nfeDadosMsg" element="tns:nfeDadosMsg"/>
</message>
<message name="nfeAutorizacaoLoteResponse">
<part name="nfeAutorizacaoLoteResult" element="tns:nfeResultMsg"/>
</message>
<portType name="NFeAutorizacao4Soap">
<operation name="nfeAutorizacaoLoteZip">
<input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/nfeAutorizacaoLoteZip" message="tns:nfeAutorizacaoLoteZip"/>
<output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/NFeAutorizacao4Soap/nfeAutorizacaoLoteZipResponse" message="tns:nfeAutorizacaoLoteZipResponse"/>
</operation>
<operation name="nfeAutorizacaoLote">
<input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/nfeAutorizacaoLote" message="tns:nfeAutorizacaoLote"/>
<output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/NFeAutorizacao4Soap/nfeAutorizacaoLoteResponse" message="tns:nfeAutorizacaoLoteResponse"/>
</operation>
</portType>
<binding name="NFeAutorizacao4SoapBinding" type="tns:NFeAutorizacao4Soap">
<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="nfeAutorizacaoLoteZip">
<soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/nfeAutorizacaoLoteZip"/>
<input>
<soap12:body use="literal"/>
</input>
<output>
<soap12:body use="literal"/>
</output>
</operation>
<operation name="nfeAutorizacaoLote">
<soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/nfeAutorizacaoLote"/>
<input>
<soap12:body use="literal"/>
</input>
<output>
<soap12:body use="literal"/>
</output>
</operation>
</binding>
<service name="NFeAutorizacao4">
<port name="NFeAutorizacao4Soap" binding="tns:NFeAutorizacao4SoapBinding">
<soap12:address location="https://hnfce.fazenda.mg.gov.br:443/nfce/services/NFeAutorizacao4"/>
</port>
</service>
</definitions>